import styled from 'styled-components';
const H1 = styled.p`
  font-size: 2em;
  font-weight: 800;
  color: white;
  margin: 0;
`;
const Hr = styled.hr`
  color: #858585;
  margin: 80px 0;
`;
const P = styled.span`
  font-size: 0.7em;
  font-weight: 400;
`;
const Italic = styled.span`
  font-size: 0.7em;
  font-weight: 400;
  color: #09a56f;
  font-style: italic;
`;
const Box = styled.div`
  margin: 20px 0;
`;

const Home = () => {
  return (
    <>
      <H1>about me</H1>
      <Box>
        <Italic>28 years</Italic> <P> / </P> <Italic>Korean</Italic>
        <P> / </P> <Italic>English</Italic>
      </Box>
      <Box>
        <P>
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
        </P>
      </Box>

      <Hr />
      <Box>
        <P>
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
        </P>
      </Box>

      <Hr />
      <Box>
        <P>
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
        </P>
      </Box>

      <Hr />
      <Box>
        <P>
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
          안녕하십니까 저는 웹, 앱 개발자를 지망하고있는 김지효입니다.
        </P>
      </Box>

      <Hr />
    </>
  );
};
export default Home;
